In [1]:
import numpy as np
import pandas as pd

<pre>
Q1 For the data frames shown below:<br/>
 
             df1
        A     B     C
    1   A1    B1    C1
    2   A2    B2    C2

             df2
        C     D
    1   C1    D1
    2   C2    D2
    3   C3    D3
</pre>

In [9]:
df1 = pd.DataFrame({
    'A' : ['A1', 'A2'],
    'B' : ['B1', 'B2'],
    'C' : ['C1', 'C2']
    }, index=[1, 2])
display(df1)

df2 = pd.DataFrame({
    'C' : ['C1', 'C2', 'C3'],
    'D' : ['D1', 'D2', 'D3']
    }, index=[1, 2, 3])
display(df2)

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    C   D
1  C1  D1
2  C2  D2
3  C3  D3

<pre>
Q1 What is the result of the merge of the two data frames?
</pre>

In [10]:
#    A    B    C
# 0  A1   B1   C1
# 1  A2   B2   B2
#
pd.merge(df1, df2)

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2

<pre>
Q2 What is the result of the outer merge of the two data frames?
</pre>

In [11]:
#    A    B    C    D
# 0  A1   B1   C1   D1
# 1  A2   B2   C2   D2
# 2  NaN  NaN  C3   D3
pd.merge(df1, df2, how='outer')

     A    B   C   D
0   A1   B1  C1  D1
1   A2   B2  C2  D2
2  NaN  NaN  C3  D3

<pre>
Q3 What is the result of the left merge of the two data frames?
<pre>

In [12]:
#    A    B    C    D
# 0  A1   B1   C1   D1
# 1  A2   B2   C2   D2   
pd.merge(df1, df2, how='left')

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2

<pre>
Q4 What is the result of the right merge of the two data frames?
</pre>

In [13]:
#    A    B    C    D
# 0  A1   B1   C1   D1
# 1  A2   B2   C2   D2
# 2  NaN  NaN  C3   D3
pd.merge(df1, df2, how='right')

     A    B   C   D
0   A1   B1  C1  D1
1   A2   B2  C2  D2
2  NaN  NaN  C3  D3

<pre>
For the data frames shown below:<br/>
 
             df1
        A     B     C
    1   A1    B1    C1
    2   A2    B2    C2

             df2
        C     D
    1   C1    D1
    2   C2    D2
    3   C1    D3
</pre>

In [16]:
df1 = pd.DataFrame({
    'A' : ['A1', 'A2'],
    'B' : ['B1', 'B2'],
    'C' : ['C1', 'C2']
    }, index=[1, 2])
display(df1)

df2 = pd.DataFrame({
    'C' : ['C1', 'C2', 'C1'],
    'D' : ['D1', 'D2', 'D3']
    }, index=[1, 2, 3])
display(df2)

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    C   D
1  C1  D1
2  C2  D2
3  C1  D3

<pre>
Q5 What is the result of the merge of the two data frames?
</pre>

In [17]:
#    A    B    C    D
# 0  A1   B1   C1   D1
# 1  A1   B1   C1   D3
# 2  A2   B2   C2   D2
pd.merge(df1, df2)

    A   B   C   D
0  A1  B1  C1  D1
1  A1  B1  C1  D3
2  A2  B2  C2  D2

<pre>
For the data frame shown below:

	Name	Score
0	A	1
1	B	10
2	A	2
3	B	20
4	A	3
5	B	30
</pre>

In [18]:
df = pd.DataFrame({
    'Name' : ['A', 'B', 'A', 'B', 'A', 'B'],
    'Score' : [1, 10, 2, 20, 3, 30]
    })
df

  Name  Score
0    A      1
1    B     10
2    A      2
3    B     20
4    A      3
5    B     30

<pre>
Q6 What is the result of the groupby’s count with Name used for the grouping?
</pre>

In [19]:
#        Score
#Name
#  A     3
#  B     3
df.groupby('Name').count()

      Score
Name
A         3
B         3

<pre>
Q7 What is the result of the groupby’s sum with Name used for the grouping?
</pre>

In [20]:
#        Score
#Name
#  A     6
#  B     60
df.groupby('Name').sum()

      Score
Name
A         6
B        60

<pre>
Q8 What is the result of the pivot_table with name used for the index?
</pre>

In [22]:
#          Score
#  Name
#    A       2
#    B      20
#
df.pivot_table(index='Name')

      Score
Name
A         2
B        20

For the data frame shown below:

<pre>
	Name	Term	Score
0	A		1		1
1	B		1		10
2	A		1		3
3	B		1		20
4	A		2		4
5	B		2		30
6	A		2		6
7	B		2		40
</pre>

In [24]:
df = pd.DataFrame({
    'Name' : ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Term' : [1, 1, 1, 1, 2, 2, 2, 2],
    'Score' : [1, 10, 3, 20, 4, 30, 6, 40]
    })
df

  Name  Term  Score
0    A     1      1
1    B     1     10
2    A     1      3
3    B     1     20
4    A     2      4
5    B     2     30
6    A     2      6
7    B     2     40

<pre>
Q9 What is the result of the groupby’s count with Name and Term used for grouping?
</pre>

In [25]:
#                Score
# Name   Term
# A        1      2
# A        2      2
# B        1      2
# B        2      2
df.groupby(['Name', 'Term']).count()

           Score
Name Term
A    1         2
     2         2
B    1         2
     2         2

<pre>
Q10 What is the result of groupby’s sum with Name and Term used for grouping?
</pre>

In [26]:
#                Score
# Name   Term
# A        1      4
# A        2      10
# B        1      30
# B        2      70
df.groupby(['Name', 'Term']).sum()

           Score
Name Term
A    1         4
     2        10
B    1        30
     2        70

<pre>
Q11 What is the result of the pivot_table with Name and Term used for the index?
</pre>

In [28]:
#                    Score
# Name    Term
#  A       1         2
#  A       2         5
#  B       1         15
#  B       2         35
df.pivot_table(index=['Name', 'Term'])

           Score
Name Term
A    1         2
     2         5
B    1        15
     2        35

<pre>
Q12 What is the result of the pivot_table with Name as the index and Term as the columns?
</pre>

In [29]:
#               Score 
# Term       1           2
# Name
#   A        2           5
#   B        15          35
df.pivot_table(index='Name', columns='Term')

     Score
Term     1   2
Name
A        2   5
B       15  35